[
    {
        "title": "To Kill a Mockingbird",
        "author": "Harper Lee",
        "description": "A young girl in the South experiences moral growth.",
        "long_description": "Set in the 1930s, 'To Kill a Mockingbird' follows Scout Finch, her brother Jem, and their father Atticus, a lawyer, who stands against racial injustice in the deep South. The story portrays the serious issues of racial inequality and rape while showcasing the innocence and growth of a child amidst the chaos.",
        "year": 1960,
        "genre": "classics, fiction, social issues",
        "price": 7.99
    },
    {
        "title": "1984",
        "author": "George Orwell",
        "description": "A dystopian society under constant surveillance.",
        "long_description": "George Orwell's '1984' is set in a totalitarian society ruled by Big Brother. The protagonist, Winston Smith, works for the Party rewriting history, but he secretly hates the regime and dreams of rebellion. The novel delves into the terrifying mechanisms of a repressive government and the impact on individual freedom.",
        "year": 1949,
        "genre": "classics, fiction, dystopia",
        "price": 8.99
    },
    {
        "title": "Brave New World",
        "author": "Aldous Huxley",
        "description": "A futuristic society driven by technology and conditioning.",
        "long_description": "In 'Brave New World,' Aldous Huxley imagines a future where humans are engineered in hatcheries and conditioned to accept their roles in society. The novel explores the impact of technology on human relationships, individuality, and freedom through the experiences of characters like Bernard Marx and John the Savage.",
        "year": 1932,
        "genre": "classics, fiction, dystopia",
        "price": 9.99
    },
    {
        "title": "The Great Gatsby",
        "author": "F. Scott Fitzgerald",
        "description": "A mysterious millionaire's tragic pursuit of the American Dream.",
        "long_description": "F. Scott Fitzgerald's 'The Great Gatsby' captures the decadence and excess of the Jazz Age. The novel tells the story of Jay Gatsby, a wealthy man who throws lavish parties in the hope of reuniting with his lost love, Daisy Buchanan. Through the eyes of narrator Nick Carraway, the novel explores themes of ambition, love, and disillusionment.",
        "year": 1925,
        "genre": "classics, fiction, romance",
        "price": 10.99
    },
    {
        "title": "Pride and Prejudice",
        "author": "Jane Austen",
        "description": "A witty commentary on love and social standing.",
        "long_description": "Jane Austen's 'Pride and Prejudice' follows Elizabeth Bennet as she navigates issues of manners, upbringing, and marriage in early 19th-century England. The novel's sharp wit and enduring romance between Elizabeth and Mr. Darcy make it a beloved classic that critiques social structures and gender roles.",
        "year": 1813,
        "genre": "classics, fiction, romance",
        "price": 6.99
    },
    {
        "title": "Dune",
        "author": "Frank Herbert",
        "description": "A young nobleman becomes embroiled in galactic politics.",
        "long_description": "Set on the desert planet of Arrakis, 'Dune' follows Paul Atreides as he navigates a world of political intrigue, rebellion, and mysticism. The novel explores themes of power, religion, and survival, with richly developed characters and a complex, immersive universe. It is widely regarded as one of the greatest science fiction novels of all time.",
        "year": 1965,
        "genre": "scifi, fiction, adventure",
        "price": 10.99
    },
    {
        "title": "Foundation",
        "author": "Isaac Asimov",
        "description": "A visionary's plan to save humanity from a dark age.",
        "long_description": "Isaac Asimov's 'Foundation' series begins with the story of Hari Seldon, a mathematician who develops the science of psychohistory to predict the future. As the Galactic Empire declines, Seldon establishes a Foundation to preserve knowledge and shorten the impending dark age. The novel explores themes of destiny, power, and resilience.",
        "year": 1951,
        "genre": "scifi, fiction, adventure",
        "price": 8.99
    },
    {
        "title": "Fahrenheit 451",
        "author": "Ray Bradbury",
        "description": "A firefighter discovers the power of books in a censored society.",
        "long_description": "In 'Fahrenheit 451,' Ray Bradbury imagines a future where books are banned, and firefighters burn them. The protagonist, Guy Montag, begins to question this society after meeting a free-spirited neighbor and secretly reading forbidden books. The novel explores themes of censorship, conformity, and the transformative power of literature.",
        "year": 1953,
        "genre": "scifi, fiction, dystopia",
        "price": 7.99
    },
    {
        "title": "Neuromancer",
        "author": "William Gibson",
        "description": "A washed-up hacker is hired for a final mission.",
        "long_description": "William Gibson's 'Neuromancer' is a seminal work in the cyberpunk genre. The story follows Case, a disgraced hacker, who is recruited by a mysterious employer for a final job that involves hacking an advanced AI. The novel's gritty portrayal of a high-tech, low-life world and its exploration of artificial intelligence and cyberspace have made it a classic.",
        "year": 1984,
        "genre": "scifi, fiction, cyberpunk",
        "price": 9.99
    },
    {
        "title": "The Left Hand of Darkness",
        "author": "Ursula K. Le Guin",
        "description": "An envoy navigates a world of ambisexual beings.",
        "long_description": "In 'The Left Hand of Darkness,' Ursula K. Le Guin explores themes of gender and identity through the story of Genly Ai, an envoy sent to the planet Gethen. The inhabitants of Gethen can change sex, challenging Genly's perceptions of gender. The novel is a profound exploration of human relationships, politics, and the nature of humanity.",
        "year": 1969,
        "genre": "scifi, fiction, social issues",
        "price": 8.99
    },
    {
        "title": "The Hobbit",
        "author": "J.R.R. Tolkien",
        "description": "A hobbit embarks on a grand adventure with dwarves.",
        "long_description": "J.R.R. Tolkien's 'The Hobbit' follows Bilbo Baggins, a hobbit who is reluctantly drawn into an epic quest to reclaim the lost Kingdom of Erebor from the dragon Smaug. Alongside a group of dwarves and the wizard Gandalf, Bilbo faces numerous challenges and discovers his own bravery. The novel is a prelude to the renowned 'Lord of the Rings' trilogy.",
        "year": 1937,
        "genre": "fantasy, fiction, adventure",
        "price": 9.99
    },
    {
        "title": "The Fellowship of the Ring",
        "author": "J.R.R. Tolkien",
        "description": "A group of heroes sets out to destroy a powerful ring.",
        "long_description": "In 'The Fellowship of the Ring,' the first volume of 'The Lord of the Rings' trilogy, J.R.R. Tolkien introduces readers to Middle-earth. Frodo Baggins inherits the One Ring and embarks on a perilous journey to destroy it, accompanied by a fellowship of diverse characters. The novel explores themes of friendship, sacrifice, and the struggle between good and evil.",
        "year": 1954,
        "genre": "fantasy, fiction, adventure",
        "price": 10.99
    },
    {
        "title": "The Lion, the Witch and the Wardrobe",
        "author": "C.S. Lewis",
        "description": "Four children discover a magical land through a wardrobe.",
        "long_description": "C.S. Lewis's 'The Lion, the Witch and the Wardrobe' transports readers to the magical land of Narnia, where four siblings discover their destiny. Guided by the lion Aslan, they must defeat the White Witch and restore peace to the land. The novel is a beloved classic that explores themes of bravery, redemption, and the power of imagination.",
        "year": 1950,
        "genre": "fantasy, fiction, children",
        "price": 7.99
    },
    {
        "title": "A Wizard of Earthsea",
        "author": "Ursula K. Le Guin",
        "description": "A young wizard's journey to master his powers.",
        "long_description": "In 'A Wizard of Earthsea,' Ursula K. Le Guin introduces Ged, a young boy with great magical potential. As he learns to control his powers, Ged faces his inner demons and external threats. The novel is a profound exploration of identity, power, and personal growth, set in a richly imagined world.",
        "year": 1968,
        "genre": "fantasy, fiction, adventure",
        "price": 8.99
    },
    {
        "title": "The Eye of the World",
        "author": "Robert Jordan",
        "description": "A farm boy discovers his destiny to save the world.",
        "long_description": "Robert Jordan's 'The Eye of the World' is the first book in the 'Wheel of Time' series. The novel follows Rand al'Thor, a young man who discovers he is destined to confront the Dark One. Accompanied by friends and mentors, Rand embarks on a journey filled with danger, magic, and prophecy. The series is renowned for its intricate world-building and epic scope.",
        "year": 1990,
        "genre": "fantasy, fiction, adventure",
        "price": 9.99
    },
    {
        "title": "Sapiens: A Brief History of Humankind",
        "author": "Yuval Noah Harari",
        "description": "An exploration of human history from the Stone Age to today.",
        "long_description": "In 'Sapiens,' Yuval Noah Harari offers a sweeping overview of human history, tracing the evolution of Homo sapiens from the Stone Age to the present. The book covers major developments such as the Cognitive Revolution, Agricultural Revolution, and Industrial Revolution, and examines how these changes have shaped societies, cultures, and individuals.",
        "year": 2011,
        "genre": "non-fiction, history, science",
        "price": 12.99
    },
    {
        "title": "The Selfish Gene",
        "author": "Richard Dawkins",
        "description": "A groundbreaking look at evolution and genetics.",
        "long_description": "Richard Dawkins' 'The Selfish Gene' presents the concept that genes are the primary drivers of evolution. The book explains complex ideas such as natural selection, gene-centered evolution, and altruism in a clear and accessible manner. It has had a significant impact on the field of evolutionary biology and popular science.",
        "year": 1976,
        "genre": "non-fiction, science, biology",
        "price": 11.99
    },
    {
        "title": "A Brief History of Time",
        "author": "Stephen Hawking",
        "description": "An accessible overview of the universe's origins and structure.",
        "long_description": "In 'A Brief History of Time,' Stephen Hawking explores fundamental questions about the universe, such as the nature of time, the Big Bang, black holes, and the fate of the cosmos. Written for a general audience, the book provides insights into complex scientific concepts without requiring advanced knowledge in physics.",
        "year": 1988,
        "genre": "non-fiction, science, physics",
        "price": 14.99
    },
    {
        "title": "The Art of War",
        "author": "Sun Tzu",
        "description": "Ancient strategies for warfare and leadership.",
        "long_description": "Sun Tzu's 'The Art of War' is a timeless treatise on military strategy and tactics, offering insights into leadership, planning, and conflict resolution. The principles outlined in the book have been applied beyond the battlefield, influencing business, politics, and sports. Its enduring relevance makes it a valuable read for anyone interested in strategy.",
        "year": -500,
        "genre": "non-fiction, history, philosophy",
        "price": 6.99
    },
    {
        "title": "The Diary of a Young Girl",
        "author": "Anne Frank",
        "description": "A young girl's account of hiding during World War II.",
        "long_description": "Anne Frank's 'The Diary of a Young Girl' chronicles her life in hiding from the Nazis during World War II. Written between 1942 and 1944, the diary provides a poignant and intimate glimpse into the thoughts and experiences of a young Jewish girl. It remains a powerful testament to the human spirit and the horrors of war.",
        "year": 1947,
        "genre": "non-fiction, autobiography, history",
        "price": 9.99
    },
    {
        "title": "Charlotte's Web",
        "author": "E.B. White",
        "description": "A pig and a spider form an unlikely friendship.",
        "long_description": "E.B. White's 'Charlotte's Web' tells the story of Wilbur, a pig, and his friendship with Charlotte, a spider who saves him from being slaughtered. Through her web, Charlotte writes messages that make Wilbur famous. The novel explores themes of friendship, loyalty, and the cycle of life, making it a cherished children's classic.",
        "year": 1952,
        "genre": "children, fiction, animals",
        "price": 7.99
    },
    {
        "title": "Where the Wild Things Are",
        "author": "Maurice Sendak",
        "description": "A boy's journey to an island of wild creatures.",
        "long_description": "Maurice Sendak's 'Where the Wild Things Are' follows Max, a young boy who sails to an island inhabited by wild creatures after being sent to bed without supper. As he becomes the king of the Wild Things, Max explores themes of imagination, anger, and the desire for home. The book is renowned for its rich illustrations and emotional depth.",
        "year": 1963,
        "genre": "children, fiction, adventure",
        "price": 6.99
    },
    {
        "title": "Goodnight Moon",
        "author": "Margaret Wise Brown",
        "description": "A bedtime story for children.",
        "long_description": "Margaret Wise Brown's 'Goodnight Moon' is a gentle bedtime story that follows a young rabbit saying goodnight to everything in his room. The soothing text and cozy illustrations by Clement Hurd create a calming atmosphere, making it a beloved classic for generations of children and parents.",
        "year": 1947,
        "genre": "children, fiction, bedtime",
        "price": 5.99
    },
    {
        "title": "The Very Hungry Caterpillar",
        "author": "Eric Carle",
        "description": "A caterpillar's journey of transformation.",
        "long_description": "Eric Carle's 'The Very Hungry Caterpillar' follows the story of a caterpillar eating his way through a variety of foods before transforming into a beautiful butterfly. The book's vibrant illustrations, simple text, and engaging story make it a favorite among young readers, teaching them about numbers, days of the week, and the life cycle of a butterfly.",
        "year": 1969,
        "genre": "children, fiction, animals",
        "price": 6.99
    },
    {
        "title": "Matilda",
        "author": "Roald Dahl",
        "description": "A gifted girl uses her powers to fight injustice.",
        "long_description": "In 'Matilda,' Roald Dahl tells the story of a brilliant young girl with extraordinary talents who overcomes the challenges posed by her neglectful parents and the tyrannical headmistress, Miss Trunchbull. With her intelligence and telekinetic powers, Matilda finds happiness and justice, making it a beloved tale of empowerment and resilience.",
        "year": 1988,
        "genre": "children, fiction, fantasy",
        "price": 7.99
    },
    {
        "title": "Beyond Good and Evil",
        "author": "Friedrich Nietzsche",
        "description": "A critique of traditional morality and philosophy.",
        "long_description": "Friedrich Nietzsche's 'Beyond Good and Evil' challenges conventional notions of morality and truth, arguing for a revaluation of values. Nietzsche critiques past philosophers for their lack of critical perspective and introduces his ideas on the will to power, perspectivism, and the 'Übermensch.' The book remains a cornerstone of existential and postmodern philosophy.",
        "year": 1886,
        "genre": "philosophy, non-fiction, classics",
        "price": 9.99
    },
    {
        "title": "Meditations",
        "author": "Marcus Aurelius",
        "description": "Reflections on life and philosophy by a Roman emperor.",
        "long_description": "In 'Meditations,' Marcus Aurelius, a Roman emperor, shares his personal reflections on Stoic philosophy. Written as a series of notes to himself, the work offers timeless wisdom on resilience, self-discipline, and the nature of human existence. The book provides insights into living a virtuous life and remains influential in both philosophy and self-help literature.",
        "year": 180,
        "genre": "philosophy, non-fiction, classics",
        "price": 8.99
    },
    {
        "title": "The Republic",
        "author": "Plato",
        "description": "A dialogue on justice, politics, and the ideal state.",
        "long_description": "Plato's 'The Republic' is a foundational text in Western philosophy and political theory. Through dialogues led by Socrates, the book explores the meaning of justice, the role of individuals in society, and the concept of the ideal state. It introduces key ideas such as the theory of forms, the allegory of the cave, and the philosopher-king.",
        "year": -380,
        "genre": "philosophy, non-fiction, classics",
        "price": 10.99
    },
    {
        "title": "Nicomachean Ethics",
        "author": "Aristotle",
        "description": "A treatise on virtue, happiness, and the good life.",
        "long_description": "Aristotle's 'Nicomachean Ethics' examines the nature of happiness and the means to

